In [4]:
#nth-highest
#select Name, salary from  employee
#where salary = (select distinct(salary) from employee order by salary desc limit n-1,1)

In [5]:
#highest
#select Name, salary from  employee
#where salary = (select distinct(salary) from employee order by salary desc limit 0,1)

#                     or

#select Name, salary from  employee 
#where salary = (select max(salary) from employee)

In [6]:
#2nd-heighest
#select Name, salary from  employee
#where salary = (select distinct(salary) from employee order by salary desc limit 1,1)

#                     or

#select Name, salary from  employee 
#where salary = (select max(salary) from employee where salary < (select max(salary) from employee))

In [8]:
#3rd-heighest
#select Name, salary from  employee
#where salary = (select distinct(salary) from employee order by salary desc limit 2,1)

#                     or

#select Name, salary from  employee 
#where salary = (select max(salary) from employee where salary< (select max(salary) from employee
#where salary < (select max(salary) from employee)))

**Highest Salary of each group**

In [9]:
#select name,dname,salary from epmloyee where (dname,salary) in (select dname, max(salary) from employee group by dname)

**2nd highest salary of each group**

http://www.crazyforcode.com/find-highest-salary-group-by-department/

In [10]:
# maximum salary in each department.

#select dname, max(salary) as msalary from employee group by dname

In [11]:
#salaries excluding the maximum salary for each department.

# select t1.dname as id ,t1.salary as s1, t2.msalary as s2 
# from employee as t1    inner join   (select dname, max(salary) as msalary from employee group by dname) as t2
# on t1.dname=t2.dname and t1.salary<t2.salary

In [12]:
#maximum salary for each department

# select emp.id, max(emp.s1)  from
# (select t1.dname as id ,t1.salary as s1, t2.msalary as s2 
# from employee as t1    inner join   (select dname, max(salary) as msalary from employee group by dname) as t2
# on t1.dname=t2.dname and t1.salary<t2.salary) as emp
# group by emp.id